---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelColumnBaseExtension
source: html/ea87cd52-8ac8-f011-5246-eda3e6911d3f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelColumnBaseExtension Property

"Base x Projection"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelColumnBaseExtension { get; }
```